package base;

public class HelloWorld {
    public static void main(String[] args){
        // 单行注释 输出一个 Hello World
        System.out.println("Hello World");


        /*
          多行注释
         */

        /**
         * JavaDoc: 文档注释
         */


        /**
         *    有趣的代码注释                            _(\_/)
         *                              ,((((^`\
         *                             ((((  (6 \
         *                           ,((((( ,    \
         *       ,,,_              ,(((((  /"._  ,`,
         *      ((((\\ ,...       ,((((   /    `-.-'
         *      )))  ;'    `"'"'""((((   (
         *     (((  /            (((      \
         *      )) |                      |
         *     ((  |        .       '     |
         *     ))  \     _ '      `t   ,.')
         *     (   |   y;- -,-""'"-.\   \/
         *     )   / ./  ) /         `\  \
         *        |./   ( (           / /'
         *        ||     \\          //'|
         *        ||      \\       _//'||
         *        ||       ))     |_/  ||
         *        \_\     |_/          ||
         *        `'"                  \_\
         *                             `'"
         *
         */
    }
}
